# encoding: utf-8
$:.unshift File.expand_path("../lib", __FILE__)
require 'bundler/setup'
require 'rspec/core/rake_task'
require 'sequel'

ROOT = File.expand_path("../",__FILE__)
DB_MIGRATION_PATH = File.join(ROOT,"db","migration")

RSpec::Core::RakeTask.new do |t|
  t.rspec_opts = %W|--color|
end

namespace :spec do
end

task :default => :spec

desc "Drop database if exist and migration the database"
task :init do
  Sequel.extension :migration
  Sequel::Migrator.run(DB,DB_MIGRATION_PATH,:target=>0)
  Sequel::Migrator.run(DB,DB_MIGRATION_PATH)
end

namespace :db do
  desc "Do migrations!"
  task :migrate do
    Sequel.extension :migration
    Sequel::Migrator.run(DB,DB_MIGRATION_PATH)
  end

  desc "prepare some data for rspec testing"
  task :prepare do
    require 'spec_helper'
    init_db
    insert_data
  end
end

private
def init_db
  Sequel.extension :migration
  Sequel::Migrator.run(DB,DB_MIGRATION_PATH,:target=>0)
  Sequel::Migrator.run(DB,DB_MIGRATION_PATH)
end

def insert_data
  user_num = 10
  fiction_num = FICTION_LIST.count

  user_num.times do
    TiebaXiaoshuoBot::User.create(:account => Faker::Internet.free_email)
  end

  FICTION_LIST.each do |e|
    TiebaXiaoshuoBot::Fiction.create(:name => e)
  end

  CL.each_line do |l|
    a = TiebaXiaoshuoBot::CheckList.new(fiction_id: $2, thread_name: "#{$3}") if l.chomp.match /^(\d+)\t(\d+)\t([^\t]*)/
    a.thread_id = $1
    a.save
  end

  TiebaXiaoshuoBot::Subscription.create(user_id: 1, fiction_id: 1)
  TiebaXiaoshuoBot::Subscription.create(user_id: 1, fiction_id: 2)
  TiebaXiaoshuoBot::Subscription.create(user_id: 1, fiction_id: 3)
  TiebaXiaoshuoBot::Subscription.create(user_id: 1, fiction_id: 4, active: false)
  TiebaXiaoshuoBot::Subscription.create(user_id: 2, fiction_id: 1)
  TiebaXiaoshuoBot::Subscription.create(user_id: 2, fiction_id: 2)
  TiebaXiaoshuoBot::Subscription.create(user_id: 2, fiction_id: 3)
end

  FICTION_LIST=%W/修真世界 吞噬星空 神印王座 遮天 龙族 雪中悍刀行 我的老婆是公主 醉卧花都/

CL =<<HERE
1736617025	4	第一千二百五十八章 魔人
1736671755	3	第一百九十九章 这算群殴么？（上）
1737648702	1	第六百八十五节 优化 【第一更】
1737735637	3	第一百九十九章 这算群殴么？（中）
1738247283	1	第六百八十六节 魔神出天下惊 【第二更】
1738369816	4	第一千二百五十九章 当街杀神骑
1738507934	2	第二十九篇 第三十四章 晋之世界的消失
1738751280	2	第二十九篇 第三十五章 原始宇宙的末期
1738774420	4	第一千二百六十章 剑动人族第一城
1738862042	3	第一百九十九章 这算群殴么？（下）
1739861554	3	第二百章 洞察魔神的寄生体（上）
1739899417	6	第四十七章 那山山楂，这湖莲花（下）
1740205275	1	第六百八十七节 英雄佳人
1740250933	1	第六百八十七节 英雄佳人
1740291922	1	第六百八十七节 英雄佳人
1740597995	6	第四十八章 老卒和桑椹
1740629073	4	第一千二百六十一章 我就是法
1740725624	2	第二十九篇 第三十六章 超脱轮回（大结局）下【下半段】
1740996786	4	第一千二百六十二章 敌
1741074091	3	第二百章 洞察魔神的寄生体（中）
1742023811	3	第二百章 洞察魔神的寄生体（下）
1742066954	1	第六百八十八节 石头
1742121954	1	第六百八十八节 石头
1742193607	6	第四十九章 呵呵姑娘
1742777976	4	第一千二百六十三章 道之源
1742975418	3	第二百零一章 皓月进化之战（上）【补更】
1743127601	4	第一千二百六十四章 天地不认可
1744039712	6	第五十章 斗鸡眼老头儿
1744250425	1	第六百八十九节 神晶
1744308034	1	第六百八十九节 神晶
1744308600	3	第二百零一章 皓月进化之战（中）
1744572302	6	第五十章 斗鸡眼老头儿
1744794549	6	第五十一章 借绣冬，给走狗
1745083052	4	第一千二百六十五章 道源洗脚
1745147286	4	第一千二百六十五章 道源洗脚
1745236022	6	第五十二章 白马出凉州
1745322348	6	第五十一章 借绣冬，给走狗
1745467202	4	第一千二百六十六章 血色战场终结
1745477363	4	第一千二百六十六章 血色战场终结
1745484680	6	第五十二章 白马出凉州
1745548535	3	第二百零一章 皓月进化之战（下）
1745692357	6	第五十一章 借绣冬,给走狗
1745696808	6	第五十二章 白马出凉州
1746627697	6	第五十三章 王旗鱼龙鼓
1746699952	3	第二百零二章 巫妖王之怒（上）
1746811373	1	第六百九十节 墓碑炼誓
1746866658	1	第六百九十节 墓碑炼誓
1747133322	6	第五十三章 王旗鱼龙鼓
1747487292	6	第五十四章 白衣送行
1747506525	4	第一千二百六十七章 血战入城
1747810120	6	第五十四章 白衣送行
1747845375	4	第一千二百六十八章 帝路黯然
1747900374	3	第二百零二章 巫妖王之怒（中）
1748603375	1	第六百九十一节 不周城
1748650086	1	第六百九十一节 不周城
1748922966	6	第一章，十二点前上传第..
1748974157	3	第二百零二章 巫妖王之怒（下）
1749259811	6	第五十五章 一剑便是百万师
1749717736	4	第一千二百六十九章 阴云密布
1749787800	6	第五十五章 一剑便是百万师
1749846606	6	第五十六章 陆地神仙
1750042228	4	第一千二百七十章 谪仙子
1750067437	6	第五十六章 陆地神仙
1750107019	3	第二百零三章 光之晨曦（大章求推荐）
1751212854	3	第二百零四章 单挑（上）
1751333981	6	第五十七章 大雨小道立红甲
1751830793	6	第五十七章 大雨小道立红甲
1751964380	4	第一千二百七十一章 价比仙经
1752003262	6	第五十八章 水珠对水甲
1752233482	6	第五十八章 水珠对水甲
1752261140	4	第一千二百七十一章 价比仙经
1752304849	6	第五十八章 水珠对水甲
1752314950	3	第二百零四章 单挑（中）
1753399607	3	第二百零四章 单挑（下）
1753446070	1	第六百九十二节 风信子
1753536461	6	第五十九章 小伞大龙卷
1753951893	4	第一千二百七十二章 无善类
1754002203	4	第一千二百七十二章 无善类
1754019519	6	第五十九章 小伞大龙卷
1754166418	6	第六十章 慢刀作画
1754373757	4	第一千二百七十三章 太古道场
1754399979	6	第六十章 慢刀作画
1754501575	3	第二百零五章 灵魂圣女的实力（上）
1755432759	3	第二百零五章 灵魂圣女的实力（中）
1756231485	4	第一千二百七十四章 元磁仙洞
1756249812	6	第六十一章 天师府上小天师（上）
1756642895	4	第一千二百七十五章 异族
1756690629	6	第六十一章 天师府上小天师（上）
1756744654	3	第二百零六章 灵魂圣女的实力（下）
1757628772	1	第六百九十三节 完整白冈蛇骨
1757638633	3	第二百零六章 挑战通灵者（上）
1757672745	1	第六百九十三节 完整白冈蛇骨
1757998948	6	第六十二章 天师府上小天师（中）
1758266371	4	第一千二百七十六章 打破苍宇
1758341792	4	第一千二百七十六章 打破苍宇
1758397571	4	第一千二百七十六章 打破苍宇
1758427544	4	第一千二百七十六章 打破苍宇
1758453006	4	第一千二百七十六章 打破苍宇
1758459338	4	第一千二百七十六章 打破苍宇
1758487580	6	第六十三章 天师府上小天师（下）
1758495148	3	第二百零六章 挑战通灵者（中）
1758499869	3	第二百零六章 挑战通灵者（下）
1758505367	3	第二百零七章 相克？（上）
1758522455	6	第六十二章 天师府上小天师（中）
1758630562	4	第一千二百七十七章 圣人劫
1758676790	6	第六十三章 天师府上小天师（下）
1759660722	1	第六百九十四节 叠兵手法
1759722327	1	第六百九十四节 叠兵手法
1760346391	6	第六十四章 两鹅换来大黄…
1760451850	4	第一千二百七十八章 千劫百难
1760751954	6	第六十四章 两鹅换来大黄门
1760792207	4	第一千二百七十八章 千劫百难
1760811530	4	第一千二百七十九章 成圣
1760909558	3	第二百零七章 相克？（中）
1761934396	3	第二百零七章 相克？（下）
1761946469	1	第六百九十五节 地阶魔兵之势
1762006292	1	第六百九十五节 地阶魔兵之势
1762171929	6	第六十五章 三碗再三碗
1762545576	6	第六十六章 当赏不当赏
1762545769	4	第一千二百八十章 无敌过关
1762679636	6	第六十五章 三碗再三碗
1762799026	3	第二百零八章 六头奇美拉？（上）
1762810033	3	第二百零八章 六头奇美拉？（中）
1762886560	4	第一千二百八十一章 成圣归来
1762889110	6	第一章迟些。
1762927125	6	第六十六章 当赏不当赏
1762958459	6	第六十七章 笑死了
1763085298	6	第六十七章 笑死了
1763132312	3	第二百零八章 六头奇美拉？（下）
1763897098	3	第二百零九章 天罗地网（上）
1764192718	1	第六百九十六节 天蛇十相矛
1764341408	1	第六百九十六节 天蛇十相矛
1764434064	3	第二百零九章 天罗地网（中）（六百票加更）
1764590965	4	第一千二百八十二章 强势还击
1764873309	6	第六十八章 打劫的
1765037974	4	第一千二百七十六章 杀无赦
1765066938	4	第一千二百八十三章 杀无赦
1765256006	4	第一千二百八十四章 忌惮
1765264979	4	第一千二百八十三章 杀无赦
1765265399	4	第一千二百八十四章 忌惮
1765290589	6	第六十八章 打劫的
1765453124	3	第二百零九章 天罗地网（下）
1765457425	3	第二百一十章 龙皓晨的抉择
1766416728	1	第六百九十七节 霸道汤辰
1766435322	1	第六百九十七节 霸道汤辰
1766438694	3	第二百一十一章 龙骑魔神阿斯莫德（上）
1766538226	1	第六百九十七节 霸道汤辰
1766555281	6	第六十九章 有紫气东来
1767040954	6	第七十章 还是打劫的
1767081736	6	第六十九章 有紫气东来
1767201610	4	第一千二百八十五章 闯燕族重地
1767246604	4	第一千二百八十五章 闯燕族重地
1767452066	6	第七十章 还是打劫的
1767501146	4	第一千二百八十六章 执法者
1767514607	6	第七十一章 青羊宫上看神仙
1767588059	6	第七十一章 青羊宫上看神仙
1767598867	3	第二百一十一章 龙骑魔神阿斯莫德（中）
1767653423	6	第七十一章 青羊宫上看神仙
1768662462	3	第二百一十一章 龙骑魔神阿斯莫德（下）
1768685240	1	第六百九十八节 意外来客
1768801538	1	第六百九十八节 意外来客
1769281026	4	第一千二百八十七章 叛逆
1769467888	6	第七十二章 青羊宫里杀神仙（上）
1769518675	3	第二百一十二章 七彩神剑（上）
1769524407	3	第二百一十二章 七彩神剑（中）
1769526546	3	第二百一十二章 七彩神剑（下）
1769531401	3	第二百一十三章 魔神皇的精神探测（上）
1769687473	4	第一千二百八十八章 正法
1769704764	6	第七十二章 青羊宫里杀神仙（上）
1771180017	1	第六百九十九节 左莫的目的
1771303245	1	第六百九十九节 左莫的目的
1771326657	4	第一千二百八十九章 皆杀
1771774122	4	第一千二百九十章 得道之地
1771857175	3	第二百一十三章 魔神皇的精神探测（中）
1772668403	1	第七百节 老谋深算
1772736744	3	第二百一十三章 魔神皇的精神探测（下）
1773408021	4	第一千二百九十一章 古路危机征兆
1773583000	3	第二百一十四章 皓月降临（中）
1773586464	3	第二百一十四章 皓月降临（下）
1773589109	3	第二百一十五章 围攻豹魔神（上）
1773749653	4	第一千二百九十二章 问心求道
1774751301	1	第七百零一节 市集
1774872376	1	第七百零一节 市集
1775245301	6	第七十三章 青羊宫内杀神仙（中）
1775689335	4	第一千二百九十三章 创道
1775835142	6	第七十四章 青羊宫里杀神仙（下）
1775879061	6	第七十三章 青羊宫内杀神仙（中）
1776064620	4	第一千二百九十四章 妖皇洞
1776106402	6	第七十四章 青羊宫里杀神仙（下）
1776121432	3	第二百一十五章 围攻豹魔神（中）
1777176400	1	第七百零二节 青花之雪
1777188827	3	第二百一十五章 围攻豹魔神（下）
1777619341	6	第七十五章 青城王低头
1778061119	4	第一千二百九十五章 圣体来了
1778168556	6	第七十六章 覆甲婢女
1778170601	6	第七十五章 青城王低头
1778390422	6	第七十六章 覆甲婢女
1778398492	4	第一千二百九十六章 阴云
1778453840	3	第二百一十六章 光之晨曦的力量！（上）
HERE
